{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 128,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 128
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 1973,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1971,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1972,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1973,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": null,
    "lowercase": true
  },
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<unk>": 0,
      "g8f6": 1,
      "g1f3": 2,
      "d2d4": 3,
      "e8g8": 4,
      "e1g1": 5,
      "b1c3": 6,
      "e2e4": 7,
      "e7e6": 8,
      "b8c6": 9,
      "g7g6": 10,
      "d7d5": 11,
      "c7c5": 12,
      "1-0": 13,
      "c2c4": 14,
      "g2g3": 15,
      "d7d6": 16,
      "h2h3": 17,
      "h7h6": 18,
      "0-1": 19,
      "a7a6": 20,
      "f8e7": 21,
      "c7c6": 22,
      "f8g7": 23,
      "c2c3": 24,
      "e7e5": 25,
      "c5d4": 26,
      "f2f4": 27,
      "f2f3": 28,
      "e4e5": 29,
      "e2e3": 30,
      "b8d7": 31,
      "f1e1": 32,
      "a2a3": 33,
      "b2b3": 34,
      "f8e8": 35,
      "f7f6": 36,
      "b7b6": 37,
      "b7b5": 38,
      "a2a4": 39,
      "h2h4": 40,
      "f7f5": 41,
      "c1e3": 42,
      "f1e2": 43,
      "f1d3": 44,
      "f1g2": 45,
      "d1d2": 46,
      "f3e5": 47,
      "h4h5": 48,
      "d4d5": 49,
      "a7a5": 50,
      "f3d4": 51,
      "h7h5": 52,
      "c4d5": 53,
      "a8c8": 54,
      "e6d5": 55,
      "c8b7": 56,
      "f6e4": 57,
      "e6e5": 58,
      "g8g7": 59,
      "d2d3": 60,
      "e4d5": 61,
      "b1d2": 62,
      "g2g4": 63,
      "c1g5": 64,
      "c8d7": 65,
      "g6g5": 66,
      "b2b4": 67,
      "f4f5": 68,
      "f6d5": 69,
      "g8h8": 70,
      "g4g5": 71,
      "b5b4": 72,
      "g7f6": 73,
      "a1c1": 74,
      "g3g4": 75,
      "a5a4": 76,
      "h5h4": 77,
      "g1h1": 78,
      "d4e5": 79,
      "g1g2": 80,
      "d8c7": 81,
      "e5e4": 82,
      "c1f4": 83,
      "a1d1": 84,
      "a4a5": 85,
      "d8d7": 86,
      "d5e4": 87,
      "e7f6": 88,
      "e3d4": 89,
      "h3h4": 90,
      "d6e5": 91,
      "c8e6": 92,
      "f5f4": 93,
      "c6c5": 94,
      "c3d5": 95,
      "a8b8": 96,
      "d1e2": 97,
      "f3f4": 98,
      "g2f3": 99,
      "d5d4": 100,
      "c4c5": 101,
      "e1c1": 102,
      "c3e4": 103,
      "f4e5": 104,
      "h6h5": 105,
      "b2c3": 106,
      "e5d4": 107,
      "g1h2": 108,
      "g5g4": 109,
      "d6d5": 110,
      "c5c4": 111,
      "f1c4": 112,
      "f6f5": 113,
      "c8g4": 114,
      "e3e4": 115,
      "f6d7": 116,
      "f1d1": 117,
      "a8d8": 118,
      "g8h7": 119,
      "g8f8": 120,
      "b4b5": 121,
      "c8f5": 122,
      "b7c6": 123,
      "c1b2": 124,
      "a1b1": 125,
      "d8e7": 126,
      "c6d4": 127,
      "g5f6": 128,
      "d4c5": 129,
      "d5c4": 130,
      "d1c2": 131,
      "c1d2": 132,
      "a6a5": 133,
      "f8d8": 134,
      "f7e6": 135,
      "c3d4": 136,
      "c6d5": 137,
      "c3c4": 138,
      "e2f3": 139,
      "f8d6": 140,
      "h5h6": 141,
      "g7g5": 142,
      "f5e4": 143,
      "d8b6": 144,
      "d3e4": 145,
      "g1f1": 146,
      "e7d6": 147,
      "b3b4": 148,
      "c6e5": 149,
      "b6b5": 150,
      "f6e5": 151,
      "g8f7": 152,
      "g7h6": 153,
      "d7e5": 154,
      "h8g8": 155,
      "g4f3": 156,
      "f2e3": 157,
      "e5e6": 158,
      "d7c6": 159,
      "c1b1": 160,
      "g1f2": 161,
      "g6f5": 162,
      "e6f5": 163,
      "d5d6": 164,
      "e5f6": 165,
      "h6g5": 166,
      "f3e4": 167,
      "e8e7": 168,
      "f3g5": 169,
      "a4a3": 170,
      "f5f6": 171,
      "e2d3": 172,
      "g5h4": 173,
      "f8b4": 174,
      "f1b5": 175,
      "h1g1": 176,
      "b4c3": 177,
      "d1e1": 178,
      "h7g6": 179,
      "a5a6": 180,
      "e4f5": 181,
      "h4h3": 182,
      "d1d3": 183,
      "d8e8": 184,
      "e3f4": 185,
      "d7c5": 186,
      "d3d4": 187,
      "d7f6": 188,
      "f4f3": 189,
      "e5f4": 190,
      "h5g6": 191,
      "e4e3": 192,
      "g5g6": 193,
      "e8d8": 194,
      "d4d3": 195,
      "g5f4": 196,
      "a3a4": 197,
      "e8c8": 198,
      "g3f4": 199,
      "g1e2": 200,
      "e1e2": 201,
      "c4b3": 202,
      "g2h3": 203,
      "e8f8": 204,
      "d3c4": 205,
      "f8f7": 206,
      "f3d2": 207,
      "d8c8": 208,
      "g4h5": 209,
      "h2g3": 210,
      "f7g6": 211,
      "e1d1": 212,
      "f8c5": 213,
      "g8e7": 214,
      "h3g4": 215,
      "a1e1": 216,
      "d6c5": 217,
      "g4f5": 218,
      "f4g3": 219,
      "f5g6": 220,
      "d1d4": 221,
      "c3e2": 222,
      "g4g3": 223,
      "f4g5": 224,
      "d8d5": 225,
      "h4g5": 226,
      "h6h7": 227,
      "h4g3": 228,
      "b5c6": 229,
      "a6b5": 230,
      "f6g4": 231,
      "b4b3": 232,
      "c4c3": 233,
      "c5c6": 234,
      "d1c1": 235,
      "a8e8": 236,
      "h5g4": 237,
      "f6g5": 238,
      "d2c3": 239,
      "b5b6": 240,
      "g7f8": 241,
      "d1f3": 242,
      "e1f1": 243,
      "f6h5": 244,
      "f2g3": 245,
      "d6d7": 246,
      "d1b3": 247,
      "e5d6": 248,
      "f3g4": 249,
      "f8g8": 250,
      "f6f7": 251,
      "a6a7": 252,
      "d8a5": 253,
      "a3a2": 254,
      "c8b8": 255,
      "f1f2": 256,
      "d7b6": 257,
      "d3d2": 258,
      "e4f3": 259,
      "b5c4": 260,
      "d2e3": 261,
      "f4e3": 262,
      "c4b5": 263,
      "a3b4": 264,
      "f3f2": 265,
      "c6e7": 266,
      "e6e7": 267,
      "e3e2": 268,
      "d8d6": 269,
      "f5e6": 270,
      "g6g7": 271,
      "d5e6": 272,
      "a4b5": 273,
      "c6c7": 274,
      "f8c8": 275,
      "c8c7": 276,
      "h3h2": 277,
      "f5g4": 278,
      "a5b4": 279,
      "b6b7": 280,
      "d2e4": 281,
      "g6h5": 282,
      "c4d3": 283,
      "d8f6": 284,
      "c3c2": 285,
      "b3c4": 286,
      "b6c5": 287,
      "d3e2": 288,
      "g3h4": 289,
      "d2c4": 290,
      "h8h7": 291,
      "d7e6": 292,
      "b4c5": 293,
      "d2f3": 294,
      "c1c2": 295,
      "c2d3": 296,
      "b3b2": 297,
      "e7f8": 298,
      "e7d7": 299,
      "h1h2": 300,
      "f6e7": 301,
      "g3g2": 302,
      "c3b5": 303,
      "f1g1": 304,
      "d5c6": 305,
      "d3c2": 306,
      "h6g7": 307,
      "d4c3": 308,
      "c8d8": 309,
      "e2d2": 310,
      "g2f1": 311,
      "d4e3": 312,
      "c7d6": 313,
      "c6a5": 314,
      "f3g3": 315,
      "c5b6": 316,
      "c1d1": 317,
      "c2b3": 318,
      "c5d6": 319,
      "f7e7": 320,
      "c5b4": 321,
      "d6e7": 322,
      "e3f2": 323,
      "f3e2": 324,
      "d2e2": 325,
      "c7b6": 326,
      "e3d2": 327,
      "f6g7": 328,
      "e4f6": 329,
      "d4c6": 330,
      "e4d3": 331,
      "h7h8": 332,
      "e7f7": 333,
      "f3h4": 334,
      "b5a4": 335,
      "e8d7": 336,
      "d7c7": 337,
      "f1c1": 338,
      "f6g6": 339,
      "a4b3": 340,
      "c3a4": 341,
      "f7g7": 342,
      "c6b5": 343,
      "d7e7": 344,
      "f2e2": 345,
      "a2b3": 346,
      "e2f2": 347,
      "d1d8": 348,
      "e2g3": 349,
      "e7f5": 350,
      "d2c2": 351,
      "e6f7": 352,
      "c3b4": 353,
      "e2f4": 354,
      "f3e3": 355,
      "g7g8": 356,
      "g5h6": 357,
      "e7d8": 358,
      "b3c2": 359,
      "h7g8": 360,
      "g7f7": 361,
      "c6b4": 362,
      "h2h1": 363,
      "c7d7": 364,
      "e7c5": 365,
      "e6d7": 366,
      "c8a6": 367,
      "b7a6": 368,
      "e3f3": 369,
      "f6e6": 370,
      "c7b7": 371,
      "d6c7": 372,
      "a8a7": 373,
      "e1e3": 374,
      "e8f7": 375,
      "c2d2": 376,
      "d8d1": 377,
      "f2g2": 378,
      "g7h7": 379,
      "e3d3": 380,
      "b6c7": 381,
      "h2g1": 382,
      "b1a1": 383,
      "d1d5": 384,
      "a5b6": 385,
      "b2a3": 386,
      "f3g2": 387,
      "e7g6": 388,
      "b8c8": 389,
      "d3e3": 390,
      "b8a8": 391,
      "e7g5": 392,
      "e6f6": 393,
      "b1c1": 394,
      "h8g7": 395,
      "e4d6": 396,
      "d7e8": 397,
      "g3f3": 398,
      "g6f7": 399,
      "d5c3": 400,
      "e6d6": 401,
      "g7e5": 402,
      "e2f1": 403,
      "h7g7": 404,
      "g2f2": 405,
      "h3g2": 406,
      "d2b3": 407,
      "e5c4": 408,
      "e1d2": 409,
      "g3f2": 410,
      "g6f6": 411,
      "e4c3": 412,
      "e2c4": 413,
      "b6a5": 414,
      "d3c3": 415,
      "a1a2": 416,
      "e5f3": 417,
      "e5c6": 418,
      "c2b2": 419,
      "e2d4": 420,
      "d6c6": 421,
      "b3a4": 422,
      "d5f6": 423,
      "g2h2": 424,
      "d8d4": 425,
      "a8f8": 426,
      "f7f8": 427,
      "d4f5": 428,
      "d7f8": 429,
      "b8b7": 430,
      "h2g2": 431,
      "d6e6": 432,
      "b1b2": 433,
      "g2g1": 434,
      "a7b6": 435,
      "f6e8": 436,
      "b4a5": 437,
      "e1f2": 438,
      "g3h3": 439,
      "e8e6": 440,
      "b8a6": 441,
      "e5d3": 442,
      "d4f3": 443,
      "g6h6": 444,
      "e7e8": 445,
      "e2d1": 446,
      "h1e1": 447,
      "b7d5": 448,
      "d1d6": 449,
      "a1f1": 450,
      "e3c5": 451,
      "h1g2": 452,
      "g4h3": 453,
      "d5f4": 454,
      "e4f4": 455,
      "e4c5": 456,
      "g5e3": 457,
      "e1e4": 458,
      "d1d7": 459,
      "d3f5": 460,
      "g4h4": 461,
      "e4d4": 462,
      "d4b3": 463,
      "e4g5": 464,
      "f1f3": 465,
      "e5d5": 466,
      "e5f5": 467,
      "e2g4": 468,
      "f8f6": 469,
      "d4e4": 470,
      "g5h5": 471,
      "f4g4": 472,
      "d1f1": 473,
      "e3g5": 474,
      "c6d7": 475,
      "a2a1": 476,
      "b7c8": 477,
      "f4e4": 478,
      "d8f8": 479,
      "e5d7": 480,
      "d5e5": 481,
      "f2f1": 482,
      "e1e5": 483,
      "a7a8": 484,
      "d2e1": 485,
      "f7e8": 486,
      "f5e5": 487,
      "f5g5": 488,
      "d7c8": 489,
      "c5e4": 490,
      "d1a4": 491,
      "c7c8": 492,
      "d7d8": 493,
      "d2f1": 494,
      "e5g4": 495,
      "d4c4": 496,
      "f4d6": 497,
      "d2f4": 498,
      "g4f4": 499,
      "e2e1": 500,
      "b6c4": 501,
      "e5g6": 502,
      "d1h5": 503,
      "d5c5": 504,
      "g5e7": 505,
      "d4b5": 506,
      "g7d4": 507,
      "b6d5": 508,
      "d4e6": 509,
      "e7d5": 510,
      "c3d2": 511,
      "g2e4": 512,
      "e4g3": 513,
      "h3g3": 514,
      "d5b6": 515,
      "e8e5": 516,
      "c7d8": 517,
      "d8d2": 518,
      "c6b6": 519,
      "g5f5": 520,
      "c8c6": 521,
      "f7g8": 522,
      "c2c1": 523,
      "d1g4": 524,
      "h6g6": 525,
      "c3d3": 526,
      "g6h7": 527,
      "d2d1": 528,
      "h5f4": 529,
      "d2c1": 530,
      "c4e3": 531,
      "c5d3": 532,
      "c6d6": 533,
      "b7c7": 534,
      "b7a7": 535,
      "g7h8": 536,
      "c4e5": 537,
      "c8c2": 538,
      "f5d3": 539,
      "b2a2": 540,
      "f8b8": 541,
      "c5e6": 542,
      "f2e1": 543,
      "d7f5": 544,
      "d5e3": 545,
      "d7b5": 546,
      "c3b3": 547,
      "b6c6": 548,
      "c1c7": 549,
      "g5e6": 550,
      "c1c3": 551,
      "c8c4": 552,
      "h5g5": 553,
      "e1e8": 554,
      "b6a6": 555,
      "d8b8": 556,
      "a5c4": 557,
      "h1d1": 558,
      "b2c2": 559,
      "h8e8": 560,
      "c4d6": 561,
      "c3b2": 562,
      "c7e7": 563,
      "d6f4": 564,
      "h4g4": 565,
      "b7e4": 566,
      "e7c6": 567,
      "f3e1": 568,
      "d8h4": 569,
      "e8e1": 570,
      "d5e7": 571,
      "c6b7": 572,
      "a6b7": 573,
      "e4d2": 574,
      "c4d4": 575,
      "b3c3": 576,
      "e6c4": 577,
      "d3b5": 578,
      "e2c3": 579,
      "c8e8": 580,
      "b7b8": 581,
      "c7b8": 582,
      "c2d1": 583,
      "b4a3": 584,
      "g3f5": 585,
      "c5d5": 586,
      "d1b1": 587,
      "e1e7": 588,
      "e8e4": 589,
      "c2e2": 590,
      "d4e2": 591,
      "g3h2": 592,
      "b2b1": 593,
      "c8c1": 594,
      "b2c1": 595,
      "h8d8": 596,
      "f2g1": 597,
      "b3a3": 598,
      "b2d4": 599,
      "g5e4": 600,
      "a7a8q": 601,
      "c4b4": 602,
      "c1a3": 603,
      "d8d3": 604,
      "d2f2": 605,
      "b1a2": 606,
      "g4e6": 607,
      "e3h6": 608,
      "c2e4": 609,
      "d8g5": 610,
      "g4e5": 611,
      "b5a6": 612,
      "c4e6": 613,
      "a2a1q": 614,
      "c8c3": 615,
      "b3d4": 616,
      "c1c8": 617,
      "h8f8": 618,
      "f6d4": 619,
      "h1f1": 620,
      "c8c5": 621,
      "b8d8": 622,
      "h5f6": 623,
      "b5d6": 624,
      "f1b1": 625,
      "a7b7": 626,
      "a4c5": 627,
      "h7h8q": 628,
      "e1e6": 629,
      "e2h5": 630,
      "c1e1": 631,
      "b8b2": 632,
      "c5b5": 633,
      "g4f6": 634,
      "e7b4": 635,
      "d3g6": 636,
      "g4e3": 637,
      "b5d7": 638,
      "c2b1": 639,
      "g2d5": 640,
      "e7h4": 641,
      "a2b2": 642,
      "c5e7": 643,
      "c5e3": 644,
      "d8a8": 645,
      "g5f3": 646,
      "b3c5": 647,
      "a3b2": 648,
      "b1c2": 649,
      "b5d3": 650,
      "b1a3": 651,
      "d2b4": 652,
      "g6f4": 653,
      "d2g5": 654,
      "b1b7": 655,
      "d1a1": 656,
      "c4e2": 657,
      "d7f7": 658,
      "h4f5": 659,
      "d1g1": 660,
      "c8a8": 661,
      "d7b7": 662,
      "d5b4": 663,
      "c7e5": 664,
      "d4d2": 665,
      "f8f5": 666,
      "f5d4": 667,
      "g3e4": 668,
      "f3d5": 669,
      "e8e2": 670,
      "b7b8q": 671,
      "b1d1": 672,
      "g2h1": 673,
      "g4e2": 674,
      "g7g8q": 675,
      "b4e7": 676,
      "e2b5": 677,
      "e7c7": 678,
      "b3d5": 679,
      "e2c2": 680,
      "d2b2": 681,
      "c3d1": 682,
      "f4d3": 683,
      "a5c7": 684,
      "b4a4": 685,
      "f4d5": 686,
      "b6d4": 687,
      "b8a7": 688,
      "f4e6": 689,
      "c1c5": 690,
      "a8a6": 691,
      "h4f6": 692,
      "f5e3": 693,
      "f1f4": 694,
      "b5a5": 695,
      "b4c4": 696,
      "b4d6": 697,
      "b2b1q": 698,
      "b4d3": 699,
      "d6f5": 700,
      "e6g4": 701,
      "b8b6": 702,
      "c1c6": 703,
      "c1c4": 704,
      "b4d2": 705,
      "b6d7": 706,
      "a6b6": 707,
      "d4f6": 708,
      "e3d5": 709,
      "a1a3": 710,
      "b7a8": 711,
      "f5d6": 712,
      "g3e5": 713,
      "b5c3": 714,
      "a5c6": 715,
      "a5b5": 716,
      "h2h1q": 717,
      "f8a8": 718,
      "b5c5": 719,
      "c8f8": 720,
      "a8a2": 721,
      "b6b2": 722,
      "a3b3": 723,
      "g6e5": 724,
      "e6d4": 725,
      "d3e5": 726,
      "e3f5": 727,
      "g8h6": 728,
      "a1a7": 729,
      "b2e5": 730,
      "d3f4": 731,
      "d8g8": 732,
      "d6e4": 733,
      "c5d7": 734,
      "e8e3": 735,
      "d7g4": 736,
      "f7f8q": 737,
      "d3f3": 738,
      "f4d2": 739,
      "e5f7": 740,
      "f6h7": 741,
      "b8c7": 742,
      "a4b4": 743,
      "e3g3": 744,
      "f8h8": 745,
      "b8e8": 746,
      "e4e2": 747,
      "e3b6": 748,
      "g2g1q": 749,
      "d5d7": 750,
      "b5d4": 751,
      "c1a1": 752,
      "d6b4": 753,
      "b1b3": 754,
      "f3h3": 755,
      "c1h6": 756,
      "g5f7": 757,
      "d1h1": 758,
      "b4d5": 759,
      "f4h6": 760,
      "c7a7": 761,
      "d2h6": 762,
      "a6c5": 763,
      "f3h2": 764,
      "f1a1": 765,
      "c7c8q": 766,
      "c6e4": 767,
      "c7f7": 768,
      "b4c6": 769,
      "a2b1": 770,
      "e5g7": 771,
      "h5f3": 772,
      "d6d8": 773,
      "f2f1q": 774,
      "b3a2": 775,
      "e6f4": 776,
      "b1e1": 777,
      "g5d2": 778,
      "a8g8": 779,
      "d5f3": 780,
      "b6d8": 781,
      "f5e7": 782,
      "f8f4": 783,
      "h4f3": 784,
      "c6d8": 785,
      "d6g3": 786,
      "d3f1": 787,
      "a6c4": 788,
      "b2a1": 789,
      "h5g3": 790,
      "d3b1": 791,
      "b7f3": 792,
      "a4c2": 793,
      "e7g7": 794,
      "d3c5": 795,
      "b6a7": 796,
      "d5c7": 797,
      "g7c3": 798,
      "c1f1": 799,
      "g6e4": 800,
      "f1f5": 801,
      "e4g6": 802,
      "e1b1": 803,
      "e8b8": 804,
      "e5g3": 805,
      "f5d7": 806,
      "c2f2": 807,
      "c2c1q": 808,
      "c2a2": 809,
      "a8a1": 810,
      "h4e7": 811,
      "a5c5": 812,
      "f3h5": 813,
      "f1f7": 814,
      "a7b8": 815,
      "b8b4": 816,
      "f8e6": 817,
      "d6c4": 818,
      "a1a4": 819,
      "f1h1": 820,
      "d7d8q": 821,
      "a4c3": 822,
      "h6f4": 823,
      "c4b6": 824,
      "d4c2": 825,
      "d4g7": 826,
      "c5b3": 827,
      "h6f5": 828,
      "a1a8": 829,
      "f8g6": 830,
      "e2g2": 831,
      "d7a4": 832,
      "f1g3": 833,
      "c5c7": 834,
      "c4c2": 835,
      "a1g1": 836,
      "a8a5": 837,
      "f6d8": 838,
      "f6h4": 839,
      "c7a5": 840,
      "d5d8": 841,
      "e3g4": 842,
      "a6c7": 843,
      "c3e5": 844,
      "d4f2": 845,
      "d6f6": 846,
      "f4h5": 847,
      "e2e1q": 848,
      "f8h6": 849,
      "e5e7": 850,
      "b5e2": 851,
      "d3d1": 852,
      "e1a1": 853,
      "c4f7": 854,
      "f1e3": 855,
      "e3c4": 856,
      "g3h5": 857,
      "b3b7": 858,
      "e7e8q": 859,
      "b7d7": 860,
      "f4h4": 861,
      "d8h8": 862,
      "c7e6": 863,
      "c2f5": 864,
      "b5c7": 865,
      "e6g6": 866,
      "f1f6": 867,
      "e7b7": 868,
      "f4e2": 869,
      "b4b2": 870,
      "b6b4": 871,
      "h8c8": 872,
      "d6f8": 873,
      "c4d2": 874,
      "h4g6": 875,
      "b2f6": 876,
      "e3c1": 877,
      "c2e3": 878,
      "d2d5": 879,
      "e8a8": 880,
      "e4g4": 881,
      "h1h3": 882,
      "e4g2": 883,
      "f4g6": 884,
      "e4f2": 885,
      "f1h3": 886,
      "c5f2": 887,
      "d2d1q": 888,
      "g8g6": 889,
      "e4c6": 890,
      "a6d3": 891,
      "a5c3": 892,
      "b8f8": 893,
      "d3h7": 894,
      "e2e5": 895,
      "g1h3": 896,
      "f6h6": 897,
      "a5b3": 898,
      "d4f4": 899,
      "g4d7": 900,
      "a4b6": 901,
      "c7c4": 902,
      "e6c5": 903,
      "b3d2": 904,
      "a3c4": 905,
      "e4c2": 906,
      "d4b6": 907,
      "h6e3": 908,
      "e6g5": 909,
      "f8f2": 910,
      "c2a4": 911,
      "b8b5": 912,
      "a7c7": 913,
      "e2b2": 914,
      "h4f2": 915,
      "a8a3": 916,
      "f4h2": 917,
      "g3e2": 918,
      "f5h4": 919,
      "d3b3": 920,
      "f8f3": 921,
      "f6f4": 922,
      "f7d7": 923,
      "e5c3": 924,
      "f5h6": 925,
      "b5b7": 926,
      "f5h5": 927,
      "e5g5": 928,
      "f3d3": 929,
      "g6e7": 930,
      "d5f7": 931,
      "d6b6": 932,
      "e1h1": 933,
      "f2d2": 934,
      "c6b8": 935,
      "c8h3": 936,
      "a1a6": 937,
      "b2d2": 938,
      "g4f2": 939,
      "e6e8": 940,
      "a4c6": 941,
      "d5b3": 942,
      "a4c4": 943,
      "b7g2": 944,
      "a8a4": 945,
      "e3e1": 946,
      "c7d5": 947,
      "f3f5": 948,
      "h1c1": 949,
      "f5c2": 950,
      "d4d1": 951,
      "d5a5": 952,
      "f3d1": 953,
      "f4f6": 954,
      "c6c8": 955,
      "e8d6": 956,
      "c5a4": 957,
      "f2d4": 958,
      "e6b3": 959,
      "d5b7": 960,
      "c3e3": 961,
      "b8b3": 962,
      "c5a7": 963,
      "d5f5": 964,
      "e8f6": 965,
      "g1g3": 966,
      "d3g3": 967,
      "d4b2": 968,
      "a6b4": 969,
      "b1f1": 970,
      "d3a6": 971,
      "e1d3": 972,
      "b6b3": 973,
      "h8h6": 974,
      "e8g6": 975,
      "d2d6": 976,
      "a3c5": 977,
      "b3d1": 978,
      "c5a5": 979,
      "c7f4": 980,
      "d3d5": 981,
      "f7h7": 982,
      "f4c7": 983,
      "b6e3": 984,
      "e3e5": 985,
      "d2g2": 986,
      "f1f8": 987,
      "g4h6": 988,
      "b6d6": 989,
      "d2a5": 990,
      "g2c6": 991,
      "f6c3": 992,
      "b7e7": 993,
      "c3c1": 994,
      "b3e6": 995,
      "e8h8": 996,
      "h3f5": 997,
      "b1b4": 998,
      "e5c7": 999,
      "b4c2": 1000,
      "a3c2": 1001,
      "a1a5": 1002,
      "e3c3": 1003,
      "a2c2": 1004,
      "c4a2": 1005,
      "h3e6": 1006,
      "f8f1": 1007,
      "h4f4": 1008,
      "f5f7": 1009,
      "h5f7": 1010,
      "a5a2": 1011,
      "f4h3": 1012,
      "f5g3": 1013,
      "e6h3": 1014,
      "h3f4": 1015,
      "a8h8": 1016,
      "g7b2": 1017,
      "d7a7": 1018,
      "f4f2": 1019,
      "c4a4": 1020,
      "c4a5": 1021,
      "d4d6": 1022,
      "e5e3": 1023,
      "a8b7": 1024,
      "a1b2": 1025,
      "a4a2": 1026,
      "c6a6": 1027,
      "b1b5": 1028,
      "h8h5": 1029,
      "f3c6": 1030,
      "a6a8": 1031,
      "d5d3": 1032,
      "d6f7": 1033,
      "c3a3": 1034,
      "d4b4": 1035,
      "e8c7": 1036,
      "a5d8": 1037,
      "d6d4": 1038,
      "f6d6": 1039,
      "g6h4": 1040,
      "h5f5": 1041,
      "c6f3": 1042,
      "h5e2": 1043,
      "b7f7": 1044,
      "f3f6": 1045,
      "a1h1": 1046,
      "a5a7": 1047,
      "d7g7": 1048,
      "c7c2": 1049,
      "f2h4": 1050,
      "e6c8": 1051,
      "e2e6": 1052,
      "d7h3": 1053,
      "e7e4": 1054,
      "h6f8": 1055,
      "c7c3": 1056,
      "b1b6": 1057,
      "e4b7": 1058,
      "f6b2": 1059,
      "h1h5": 1060,
      "c6e6": 1061,
      "b3b6": 1062,
      "b3d3": 1063,
      "c3f6": 1064,
      "g6d3": 1065,
      "g3d6": 1066,
      "b6b8": 1067,
      "e1g3": 1068,
      "c2d4": 1069,
      "c4f1": 1070,
      "e4e6": 1071,
      "f5f3": 1072,
      "b3a5": 1073,
      "c4c6": 1074,
      "g4g6": 1075,
      "a3a1": 1076,
      "d5d2": 1077,
      "h5h7": 1078,
      "d7d4": 1079,
      "b2e2": 1080,
      "d5g2": 1081,
      "f5h3": 1082,
      "e4h4": 1083,
      "f6g8": 1084,
      "b2g7": 1085,
      "d2a2": 1086,
      "c5f8": 1087,
      "f2h2": 1088,
      "c4e4": 1089,
      "g5g3": 1090,
      "c6e8": 1091,
      "b2f2": 1092,
      "c5e5": 1093,
      "a7d7": 1094,
      "d5b5": 1095,
      "h1h4": 1096,
      "e4c4": 1097,
      "g5g7": 1098,
      "c6c4": 1099,
      "c5c3": 1100,
      "e5c5": 1101,
      "b6a4": 1102,
      "a5a3": 1103,
      "h2g4": 1104,
      "b3b5": 1105,
      "e7a3": 1106,
      "f5h7": 1107,
      "c8g8": 1108,
      "e5b2": 1109,
      "e2c1": 1110,
      "e6c6": 1111,
      "f4d4": 1112,
      "c3b1": 1113,
      "b8b1": 1114,
      "c2c5": 1115,
      "f6f8": 1116,
      "g3g5": 1117,
      "f3b7": 1118,
      "e6e4": 1119,
      "e3a7": 1120,
      "c4c7": 1121,
      "a6c6": 1122,
      "d1e3": 1123,
      "g3e3": 1124,
      "h8h4": 1125,
      "h1h7": 1126,
      "h4h6": 1127,
      "c3c5": 1128,
      "c2c7": 1129,
      "d3f2": 1130,
      "g5h3": 1131,
      "d5d1": 1132,
      "e4e1": 1133,
      "e2a6": 1134,
      "b4b6": 1135,
      "h6f7": 1136,
      "a3d6": 1137,
      "e5e1": 1138,
      "b1b8": 1139,
      "d3b4": 1140,
      "c6a4": 1141,
      "b3b1": 1142,
      "c2g6": 1143,
      "a3c3": 1144,
      "a5d2": 1145,
      "c7g7": 1146,
      "g4e4": 1147,
      "g2b7": 1148,
      "c7b5": 1149,
      "e7c8": 1150,
      "f6f3": 1151,
      "f3f7": 1152,
      "b5a3": 1153,
      "d2d7": 1154,
      "g5e5": 1155,
      "e5e2": 1156,
      "h5g7": 1157,
      "d2d8": 1158,
      "g5d8": 1159,
      "d4d7": 1160,
      "f3f1": 1161,
      "c2g2": 1162,
      "b4d4": 1163,
      "e8c6": 1164,
      "d6b5": 1165,
      "d4d8": 1166,
      "a7e7": 1167,
      "g6e6": 1168,
      "f7d5": 1169,
      "f4c1": 1170,
      "g8g5": 1171,
      "g4g2": 1172,
      "c1g1": 1173,
      "f7c7": 1174,
      "g1e1": 1175,
      "f7e5": 1176,
      "h3f3": 1177,
      "d7b8": 1178,
      "e5h5": 1179,
      "h7g5": 1180,
      "g1g4": 1181,
      "f5d5": 1182,
      "c3c7": 1183,
      "c2c6": 1184,
      "d6b8": 1185,
      "c5c2": 1186,
      "c3e1": 1187,
      "h5h3": 1188,
      "g4g7": 1189,
      "a2d2": 1190,
      "c3a5": 1191,
      "e5e8": 1192,
      "g6f8": 1193,
      "a6c8": 1194,
      "b1e4": 1195,
      "g8e8": 1196,
      "c4b2": 1197,
      "f2c2": 1198,
      "b4b7": 1199,
      "d4h4": 1200,
      "d6d2": 1201,
      "a6e2": 1202,
      "c8h8": 1203,
      "a7f7": 1204,
      "c5a6": 1205,
      "h6h8": 1206,
      "a4a7": 1207,
      "g3f1": 1208,
      "a3b5": 1209,
      "e2e7": 1210,
      "h8b8": 1211,
      "g4d1": 1212,
      "h6f6": 1213,
      "b6c8": 1214,
      "a4a6": 1215,
      "e7a7": 1216,
      "b5b3": 1217,
      "d7d2": 1218,
      "e1h4": 1219,
      "c4a3": 1220,
      "g6g4": 1221,
      "d7d1": 1222,
      "c4a6": 1223,
      "f5c8": 1224,
      "g5c1": 1225,
      "c5b7": 1226,
      "e8h5": 1227,
      "a4d7": 1228,
      "e7e3": 1229,
      "h1h8": 1230,
      "d3d7": 1231,
      "a2e2": 1232,
      "f8d7": 1233,
      "c3f3": 1234,
      "b1d3": 1235,
      "h3g5": 1236,
      "d7d3": 1237,
      "e4e7": 1238,
      "f4f7": 1239,
      "h4h2": 1240,
      "c6c2": 1241,
      "g1g7": 1242,
      "g1d1": 1243,
      "g8g4": 1244,
      "f2e4": 1245,
      "b5d5": 1246,
      "d6g6": 1247,
      "h1h6": 1248,
      "h7f6": 1249,
      "b5f1": 1250,
      "f7g5": 1251,
      "f7h5": 1252,
      "c1h1": 1253,
      "g1g5": 1254,
      "f7b7": 1255,
      "d6a3": 1256,
      "f7d6": 1257,
      "e2a2": 1258,
      "d5h5": 1259,
      "e1c3": 1260,
      "c3a2": 1261,
      "g3g6": 1262,
      "g8d8": 1263,
      "h3f2": 1264,
      "h1b1": 1265,
      "a2f2": 1266,
      "h7f7": 1267,
      "b6f2": 1268,
      "d6b7": 1269,
      "e6f8": 1270,
      "d4a4": 1271,
      "b5b2": 1272,
      "e6c7": 1273,
      "h6g4": 1274,
      "b8g8": 1275,
      "f5g7": 1276,
      "d3d6": 1277,
      "b3e3": 1278,
      "f2b2": 1279,
      "h8a8": 1280,
      "g5h7": 1281,
      "c5c8": 1282,
      "f2d3": 1283,
      "d4g4": 1284,
      "d8e6": 1285,
      "e3h3": 1286,
      "a5b7": 1287,
      "g7f5": 1288,
      "g8g2": 1289,
      "e7e2": 1290,
      "f6f2": 1291,
      "e6a2": 1292,
      "e1f3": 1293,
      "h8h2": 1294,
      "f3c3": 1295,
      "f7f4": 1296,
      "a3a5": 1297,
      "h6h4": 1298,
      "e6g7": 1299,
      "c4c1": 1300,
      "e4e8": 1301,
      "f2g4": 1302,
      "c6g2": 1303,
      "g7e7": 1304,
      "a4a1": 1305,
      "g1g6": 1306,
      "a5d5": 1307,
      "d6e8": 1308,
      "a5a8": 1309,
      "b7b4": 1310,
      "a3e7": 1311,
      "f2c5": 1312,
      "d6a6": 1313,
      "c5a3": 1314,
      "h8h3": 1315,
      "c3c6": 1316,
      "b7c5": 1317,
      "b6e6": 1318,
      "c6c3": 1319,
      "d6h2": 1320,
      "h3f1": 1321,
      "a2d5": 1322,
      "b8e5": 1323,
      "e3e7": 1324,
      "d3b2": 1325,
      "h4e4": 1326,
      "h5e5": 1327,
      "d6d1": 1328,
      "g6g8": 1329,
      "c2b4": 1330,
      "h3h5": 1331,
      "b1g1": 1332,
      "a4d1": 1333,
      "e3e6": 1334,
      "g3g7": 1335,
      "h3h1": 1336,
      "c3g7": 1337,
      "h1a1": 1338,
      "b2c4": 1339,
      "e3c2": 1340,
      "c1d3": 1341,
      "h4h7": 1342,
      "a3c1": 1343,
      "e7e1": 1344,
      "d3d8": 1345,
      "c7c1": 1346,
      "g5g2": 1347,
      "c6a7": 1348,
      "a7d4": 1349,
      "h8h1": 1350,
      "c2c8": 1351,
      "h5h8": 1352,
      "e2e8": 1353,
      "b8h8": 1354,
      "a6f1": 1355,
      "e4h7": 1356,
      "g8g3": 1357,
      "d5a2": 1358,
      "f2f5": 1359,
      "a2c4": 1360,
      "e3f1": 1361,
      "b3f7": 1362,
      "a6a4": 1363,
      "b5e8": 1364,
      "c7g3": 1365,
      "d6d3": 1366,
      "d4a7": 1367,
      "b7b2": 1368,
      "b7b3": 1369,
      "e7h7": 1370,
      "c4c8": 1371,
      "b8d6": 1372,
      "f5f2": 1373,
      "h2f3": 1374,
      "d2h2": 1375,
      "e6e2": 1376,
      "b4a6": 1377,
      "f1a6": 1378,
      "a5e5": 1379,
      "g2e2": 1380,
      "d3h3": 1381,
      "b2b6": 1382,
      "a4b2": 1383,
      "h6d2": 1384,
      "b4f8": 1385,
      "b2g2": 1386,
      "d6c8": 1387,
      "c6f6": 1388,
      "b7g7": 1389,
      "d3a3": 1390,
      "g6g3": 1391,
      "b3f3": 1392,
      "b1h1": 1393,
      "a6d6": 1394,
      "f4g2": 1395,
      "b4e1": 1396,
      "a8c6": 1397,
      "e3b3": 1398,
      "b3c1": 1399,
      "b2d3": 1400,
      "e1c2": 1401,
      "b7d6": 1402,
      "e2h2": 1403,
      "a4d4": 1404,
      "g3e1": 1405,
      "d3e1": 1406,
      "a2a5": 1407,
      "g6e8": 1408,
      "c8d6": 1409,
      "b2b7": 1410,
      "g4c8": 1411,
      "a7c5": 1412,
      "c3g3": 1413,
      "g3g1": 1414,
      "h2f2": 1415,
      "b2b5": 1416,
      "a8d5": 1417,
      "d5g5": 1418,
      "g8c8": 1419,
      "e6e3": 1420,
      "h8f6": 1421,
      "a7a4": 1422,
      "c7e8": 1423,
      "f2f6": 1424,
      "a7e3": 1425,
      "h4g2": 1426,
      "e6h6": 1427,
      "f7f3": 1428,
      "e3g2": 1429,
      "b5b8": 1430,
      "c5c1": 1431,
      "e4b1": 1432,
      "a7g7": 1433,
      "a3d3": 1434,
      "c4f4": 1435,
      "g3d3": 1436,
      "e8g7": 1437,
      "d7h7": 1438,
      "a2g2": 1439,
      "b4b1": 1440,
      "h4h1": 1441,
      "f6c6": 1442,
      "f8a3": 1443,
      "e3g1": 1444,
      "d1f2": 1445,
      "b5a7": 1446,
      "a1c3": 1447,
      "a6a2": 1448,
      "a1d4": 1449,
      "b6f6": 1450,
      "e6e1": 1451,
      "c3c8": 1452,
      "f2f7": 1453,
      "h2f4": 1454,
      "e6b6": 1455,
      "g1c1": 1456,
      "e5h2": 1457,
      "d2b1": 1458,
      "h3h6": 1459,
      "f3g1": 1460,
      "a3a7": 1461,
      "e3e8": 1462,
      "a5a1": 1463,
      "g7e6": 1464,
      "g2f4": 1465,
      "f5b1": 1466,
      "f4f1": 1467,
      "g6c2": 1468,
      "h4d8": 1469,
      "d3c1": 1470,
      "f7h6": 1471,
      "a8e4": 1472,
      "e8b5": 1473,
      "h2e5": 1474,
      "a4e4": 1475,
      "e7g8": 1476,
      "c3a1": 1477,
      "h7f5": 1478,
      "f5f8": 1479,
      "c6a8": 1480,
      "f1d2": 1481,
      "b1f5": 1482,
      "h4e1": 1483,
      "a3a6": 1484,
      "c7a8": 1485,
      "h7d3": 1486,
      "a6a3": 1487,
      "h7e4": 1488,
      "h3e3": 1489,
      "g6g2": 1490,
      "f7f2": 1491,
      "h3d7": 1492,
      "h4d4": 1493,
      "b4e4": 1494,
      "e6d8": 1495,
      "h5h2": 1496,
      "e3d1": 1497,
      "e5b8": 1498,
      "f6h8": 1499,
      "f3b3": 1500,
      "a3e3": 1501,
      "b4a2": 1502,
      "a7a2": 1503,
      "d8c6": 1504,
      "a7a3": 1505,
      "a2a6": 1506,
      "a1e5": 1507,
      "f7c4": 1508,
      "h3h7": 1509,
      "f7a7": 1510,
      "g3c7": 1511,
      "c6c1": 1512,
      "f4b8": 1513,
      "h5e8": 1514,
      "b4b8": 1515,
      "c5f5": 1516,
      "a2e6": 1517,
      "a4a8": 1518,
      "a6e6": 1519,
      "e2g1": 1520,
      "c8e7": 1521,
      "g4h2": 1522,
      "g4d4": 1523,
      "e4b4": 1524,
      "e5a5": 1525,
      "e1b4": 1526,
      "a2a7": 1527,
      "h6h3": 1528,
      "h5d1": 1529,
      "g7d7": 1530,
      "d1c3": 1531,
      "h6e6": 1532,
      "c7h7": 1533,
      "f2a2": 1534,
      "a7b5": 1535,
      "e6g8": 1536,
      "g8b8": 1537,
      "g2d2": 1538,
      "d8f7": 1539,
      "c2h2": 1540,
      "a2b4": 1541,
      "c6g6": 1542,
      "f4c4": 1543,
      "a3f8": 1544,
      "g2e3": 1545,
      "h5d5": 1546,
      "h4h8": 1547,
      "g8a8": 1548,
      "g2g5": 1549,
      "h7e7": 1550,
      "d6h6": 1551,
      "g6d6": 1552,
      "h7f8": 1553,
      "g7g4": 1554,
      "f2h3": 1555,
      "c7a6": 1556,
      "e4a4": 1557,
      "c4g4": 1558,
      "e3a3": 1559,
      "a3f3": 1560,
      "b3g3": 1561,
      "g1a1": 1562,
      "b5e5": 1563,
      "d5a8": 1564,
      "h8e5": 1565,
      "h1f3": 1566,
      "g1b1": 1567,
      "f2b6": 1568,
      "a5f5": 1569,
      "g7c7": 1570,
      "b8f4": 1571,
      "e5b5": 1572,
      "g5d5": 1573,
      "g2c2": 1574,
      "e6a6": 1575,
      "c8b6": 1576,
      "a7a1": 1577,
      "b7h7": 1578,
      "f6b6": 1579,
      "f4f8": 1580,
      "c1b3": 1581,
      "b2b8": 1582,
      "a7c6": 1583,
      "c5g5": 1584,
      "d4a1": 1585,
      "h2e2": 1586,
      "a7h7": 1587,
      "g1g8": 1588,
      "b4f4": 1589,
      "c1e2": 1590,
      "a2c3": 1591,
      "b5b1": 1592,
      "f1h2": 1593,
      "f8h7": 1594,
      "b3b8": 1595,
      "g3c3": 1596,
      "b7b1": 1597,
      "g7g3": 1598,
      "a5h5": 1599,
      "h7h4": 1600,
      "f3h1": 1601,
      "a4e8": 1602,
      "a5e1": 1603,
      "g2g6": 1604,
      "a2a8": 1605,
      "c2e1": 1606,
      "f5c5": 1607,
      "b2h2": 1608,
      "f5f1": 1609,
      "a2h2": 1610,
      "c4h4": 1611,
      "a4f4": 1612,
      "b6b1": 1613,
      "f3f8": 1614,
      "c2h7": 1615,
      "a6f6": 1616,
      "g7b7": 1617,
      "h5h1": 1618,
      "g8g1": 1619,
      "a3a8": 1620,
      "g2b2": 1621,
      "f7d8": 1622,
      "g5g8": 1623,
      "a6a1": 1624,
      "h3d3": 1625,
      "h2f1": 1626,
      "h6c1": 1627,
      "g8e6": 1628,
      "h2d2": 1629,
      "f6f1": 1630,
      "g1e3": 1631,
      "c5h5": 1632,
      "b6g6": 1633,
      "h1e4": 1634,
      "d4g1": 1635,
      "e4a8": 1636,
      "a8f3": 1637,
      "g1d4": 1638,
      "c3h3": 1639,
      "f7f1": 1640,
      "h7d7": 1641,
      "h2h5": 1642,
      "a3g3": 1643,
      "h6h2": 1644,
      "e1g2": 1645,
      "f2f8": 1646,
      "h7b7": 1647,
      "e8a4": 1648,
      "g7h5": 1649,
      "g4g1": 1650,
      "b1g6": 1651,
      "a6b8": 1652,
      "e5h8": 1653,
      "f2d1": 1654,
      "e5a1": 1655,
      "c2a1": 1656,
      "f4b4": 1657,
      "g4c4": 1658,
      "h2b2": 1659,
      "b6a8": 1660,
      "f3a3": 1661,
      "h3c8": 1662,
      "b5f5": 1663,
      "c2a3": 1664,
      "a5g5": 1665,
      "a1f6": 1666,
      "h7c7": 1667,
      "h2c2": 1668,
      "g7g2": 1669,
      "d5g8": 1670,
      "h4c4": 1671,
      "f3a8": 1672,
      "g8d5": 1673,
      "f7b3": 1674,
      "g5c5": 1675,
      "h3h8": 1676,
      "g2g7": 1677,
      "e4h1": 1678,
      "g7a7": 1679,
      "g6c6": 1680,
      "f6a1": 1681,
      "a4g4": 1682,
      "h2d6": 1683,
      "g4g8": 1684,
      "h6d6": 1685,
      "a6g6": 1686,
      "h7a7": 1687,
      "h5c5": 1688,
      "g2a2": 1689,
      "b7a5": 1690,
      "g7a1": 1691,
      "f4a4": 1692,
      "e1a5": 1693,
      "h2h7": 1694,
      "f6a6": 1695,
      "h3c3": 1696,
      "h7h3": 1697,
      "b4g4": 1698,
      "h8d4": 1699,
      "h2h6": 1700,
      "a4h4": 1701,
      "b3h3": 1702,
      "g5g1": 1703,
      "b2a4": 1704,
      "g3b3": 1705,
      "h2a2": 1706,
      "c5g1": 1707,
      "f5b5": 1708,
      "b7d8": 1709,
      "g7e8": 1710,
      "c7h2": 1711,
      "f5a5": 1712,
      "c6h6": 1713,
      "g3g8": 1714,
      "g2a8": 1715,
      "h6h1": 1716,
      "b3a1": 1717,
      "a7f2": 1718,
      "b8g3": 1719,
      "f7h8": 1720,
      "b5g5": 1721,
      "b4h4": 1722,
      "g2h4": 1723,
      "g6b1": 1724,
      "a3h3": 1725,
      "d8b7": 1726,
      "f2a7": 1727,
      "d4h8": 1728,
      "h1d5": 1729,
      "d1b2": 1730,
      "b2d1": 1731,
      "g4b4": 1732,
      "b6h6": 1733,
      "g6h8": 1734,
      "g1c5": 1735,
      "c4g8": 1736,
      "a8c7": 1737,
      "g3b8": 1738,
      "a2c1": 1739,
      "a7c8": 1740,
      "h7h2": 1741,
      "g6b6": 1742,
      "g3h1": 1743,
      "h3b3": 1744,
      "h4b4": 1745,
      "g6g1": 1746,
      "g3a3": 1747,
      "h2h8": 1748,
      "a6h6": 1749,
      "h6c6": 1750,
      "b5h5": 1751,
      "h6g8": 1752,
      "d5h1": 1753,
      "g4a4": 1754,
      "h5a5": 1755,
      "a2f7": 1756,
      "g5a5": 1757,
      "h7h1": 1758,
      "a3b1": 1759,
      "g8c4": 1760,
      "h4a4": 1761,
      "g2g8": 1762,
      "g5b5": 1763,
      "g7g1": 1764,
      "h5b5": 1765,
      "a8b6": 1766,
      "g6a6": 1767,
      "a8g2": 1768,
      "g2e1": 1769,
      "c8a7": 1770,
      "f2h1": 1771,
      "h3a3": 1772,
      "h6b6": 1773,
      "a1g7": 1774,
      "b6g1": 1775,
      "f7a2": 1776,
      "h3g1": 1777,
      "h8c3": 1778,
      "a1c2": 1779,
      "c1a2": 1780,
      "h6a6": 1781,
      "h7c2": 1782,
      "h8f7": 1783,
      "c3h8": 1784,
      "c6h1": 1785,
      "g1b6": 1786,
      "b3g8": 1787,
      "h1c6": 1788,
      "h1f2": 1789,
      "b1h7": 1790,
      "h8g6": 1791,
      "a1b3": 1792,
      "h2c7": 1793,
      "g8b3": 1794,
      "b7h1": 1795,
      "h1g3": 1796,
      "b8h2": 1797,
      "h8b2": 1798,
      "b2h8": 1799,
      "h1b7": 1800,
      "g1a7": 1801,
      "g8a2": 1802,
      "a7g1": 1803,
      "h7b1": 1804,
      "a8h1": 1805,
      "a1h8": 1806,
      "h8a1": 1807,
      "h2b8": 1808,
      "e7f8q": 1809,
      "h1a8": 1810,
      "a2g8": 1811,
      "d7e8q": 1812,
      "g7f8q": 1813,
      "e2f1q": 1814,
      "f7e8q": 1815,
      "e7d8q": 1816,
      "h7g8q": 1817,
      "c7d8q": 1818,
      "d7c8q": 1819,
      "c2d1q": 1820,
      "d2e1q": 1821,
      "a7b8q": 1822,
      "a2b1q": 1823,
      "b2c1q": 1824,
      "g2f1q": 1825,
      "b7c8q": 1826,
      "f2e1q": 1827,
      "e2d1q": 1828,
      "h7h8r": 1829,
      "h2g1q": 1830,
      "b2a1q": 1831,
      "d2c1q": 1832,
      "b7a8q": 1833,
      "a7a8r": 1834,
      "f7g8q": 1835,
      "a2a1r": 1836,
      "g7g8r": 1837,
      "c7b8q": 1838,
      "f7f8r": 1839,
      "h2h1r": 1840,
      "b7b8r": 1841,
      "g7h8q": 1842,
      "c2b1q": 1843,
      "f2f1r": 1844,
      "b2b1r": 1845,
      "g2g1r": 1846,
      "e7e8r": 1847,
      "f7f8n": 1848,
      "c7c8r": 1849,
      "f2g1q": 1850,
      "e2e1r": 1851,
      "c2c1r": 1852,
      "f2f1n": 1853,
      "d7d8r": 1854,
      "h7h8n": 1855,
      "g7g8n": 1856,
      "e7e8n": 1857,
      "d2d1r": 1858,
      "g2g1n": 1859,
      "h2h1n": 1860,
      "g2h1q": 1861,
      "a2a1n": 1862,
      "e2e1n": 1863,
      "a7a8n": 1864,
      "b2b1n": 1865,
      "b7b8n": 1866,
      "c7c8n": 1867,
      "c2c1n": 1868,
      "d7d8n": 1869,
      "d2d1n": 1870,
      "h7h8b": 1871,
      "g7g8b": 1872,
      "a2a1b": 1873,
      "a7a8b": 1874,
      "f7f8b": 1875,
      "b7b8b": 1876,
      "h2h1b": 1877,
      "b2b1b": 1878,
      "g2g1b": 1879,
      "f2f1b": 1880,
      "c2c1b": 1881,
      "c7c8b": 1882,
      "e7e8b": 1883,
      "e2e1b": 1884,
      "d7d8b": 1885,
      "d2d1b": 1886,
      "e7f8r": 1887,
      "g7f8r": 1888,
      "h7g8r": 1889,
      "g7f8n": 1890,
      "f7e8r": 1891,
      "e2f1r": 1892,
      "d7e8r": 1893,
      "f7e8n": 1894,
      "e7f8n": 1895,
      "e7d8r": 1896,
      "g2f1r": 1897,
      "g2f1n": 1898,
      "b7c8r": 1899,
      "c7d8r": 1900,
      "e2f1n": 1901,
      "c2d1r": 1902,
      "d2e1r": 1903,
      "a2b1r": 1904,
      "d7c8r": 1905,
      "f7g8r": 1906,
      "a7b8r": 1907,
      "d7e8n": 1908,
      "h2g1r": 1909,
      "b2c1r": 1910,
      "e2d1r": 1911,
      "f2e1r": 1912,
      "f2e1n": 1913,
      "c2d1n": 1914,
      "b2a1r": 1915,
      "c7b8r": 1916,
      "d2e1n": 1917,
      "d7c8n": 1918,
      "d2c1r": 1919,
      "e7d8n": 1920,
      "b2c1n": 1921,
      "c7d8n": 1922,
      "g7h8r": 1923,
      "c2b1r": 1924,
      "b7a8r": 1925,
      "f2g1n": 1926,
      "f2g1r": 1927,
      "f7g8n": 1928,
      "h7g8n": 1929,
      "b7c8n": 1930,
      "e2d1n": 1931,
      "a2b1n": 1932,
      "a7b8n": 1933,
      "e7f8b": 1934,
      "b7a8n": 1935,
      "d2c1n": 1936,
      "d7c8b": 1937,
      "g7h8n": 1938,
      "c7b8n": 1939,
      "g2h1r": 1940,
      "g7f8b": 1941,
      "h2g1n": 1942,
      "f7g8b": 1943,
      "b7a8b": 1944,
      "a2b1b": 1945,
      "b2c1b": 1946,
      "c2b1n": 1947,
      "f7e8b": 1948,
      "h7g8b": 1949,
      "b2a1n": 1950,
      "c7d8b": 1951,
      "d2e1b": 1952,
      "d7e8b": 1953,
      "e2f1b": 1954,
      "e7d8b": 1955,
      "f2g1b": 1956,
      "b2a1b": 1957,
      "b7c8b": 1958,
      "c2d1b": 1959,
      "g2f1b": 1960,
      "h2g1b": 1961,
      "a7b8b": 1962,
      "d2c1b": 1963,
      "g7h8b": 1964,
      "c7b8b": 1965,
      "f2e1b": 1966,
      "c2b1b": 1967,
      "e2d1b": 1968,
      "g2h1n": 1969,
      "g2h1b": 1970
    },
    "unk_token": "<unk>"
  }
}